/* No comment provided by engineer. */
"Long press the widget and edit it to select a Ledger" = "Long press the widget and edit it to select a Ledger";

/* No comment provided by engineer. */
"Please select a Ledger" = "Please select a Ledger";

/* View your Budgets */
"View your Budgets" = "View your Budgets";

